[
  {
    "id": "screening_1748898654332",
    "applicationId": "app-1748898653089",
    "candidateId": "candidate-1748898653079",
    "jobId": "job-001",
    "status": "screening_completed",
    "scheduledAt": "2025-06-02T21:10:54.332Z",
    "createdAt": "2025-06-02T21:10:54.332Z",
    "updatedAt": "2025-06-02T21:12:41.887Z",
    "date": "2025-06-02T21:10:54.332Z",
    "role": "general",
    "summary": "# Server Position Screening Summary\n\n## Candidate: Sarah\n\n### 1. Relevant Experience\n- 10 years of experience as a server in fast food restaurants\n\n### 2. Availability\n- Evening shifts only\n- Not available on weekends\n- Has reliable transportation\n\n### 3. Key Responses to Role-Specific Questions\n- Claims to have skills in:\n  - Handling POS systems\n  - Multitasking during busy shifts\n  - Working with large parties\n\n### 4. Communication Skills Assessment\n- Provided very brief, minimal responses\n- Did not elaborate on skills or experience when given the opportunity\n- Answered questions directly but without detail\n\n### 5. Concerns/Red Flags\n- Limited availability (evenings only, no weekends) may not align with restaurant needs\n- Extremely brief responses without specific examples or details about claimed skills\n- Did not demonstrate enthusiasm or engagement during the screening call\n- While claiming 10 years of experience, candidate did not voluntarily share any specific achievements or strengths\n\nThe candidate has significant experience but limited availability and provided minimal information during the screening process.",
    "transcript": "AI: Hi, Sarah. I'm the AI screening assistant for the server position. This call will take about 2, 3 minutes and will be recorded for quality and training purposes. I'll be asking you some questions about your experience and availability. Let's get started. Could you tell me about your relevant experience for this server role?\nUser: I've been working at server in fast food restaurant for about 10 years.\nAI: Thank you for sharing that. It sounds like you have significant experience in the food service industry. Next, could you share your availability for shifts? Are you able to work morning, evening, or both?\nUser: I cannot work morning shift. I can only work evening shifts.\nAI: Got it. Thank you. You? Are you available on weekends as well for evening shifts?\nUser: No.\nAI: Thank you for clarifying. Could you tell me about your transportation arrangements? Do you have reliable transportation to and from work?\nUser: Yes. I do.\nAI: Great. Thank you. Now could you tell me about any specific skills you have that are relevant to working as a a server such as handling PO systems, multitasking during busy shifts, or working with large parties?\nUser: Yes. I have all those skills.\nAI: That's good to know. Thank you so much for answering all of my questions. We'll now review your responses, and a recruiter will get back to you soon. Have a great day. Goodbye.\n",
    "audioUrl": "https://storage.vapi.ai/63784a12-d510-4b66-b685-154fea8a257d-1748898753879-dcf2abc0-ba42-4c6e-abbd-dee5afae09c0-mono.wav",
    "completedAt": "2025-06-02T21:12:41.882Z"
  },
  {
    "id": "screening_1748899663005",
    "applicationId": "app-1748899661887",
    "candidateId": "candidate-1748899661884",
    "jobId": "job-003",
    "status": "screening_completed",
    "scheduledAt": "2025-06-02T21:27:43.005Z",
    "createdAt": "2025-06-02T21:27:43.005Z",
    "updatedAt": "2025-06-02T21:29:21.733Z",
    "date": "2025-06-02T21:27:43.005Z",
    "role": "general",
    "summary": "# Host/Hostess Screening Call Summary\n\n## Candidate: Joel\n\n### 1. Relevant Experience\n- No prior host/hostess experience\n\n### 2. Availability\n- Available for both morning and evening shifts\n- Available to work weekends (Saturdays and Sundays)\n- Does not have reliable transportation\n\n### 3. Key Responses to Role-specific Questions\n- Expressed comfort with greeting guests, managing reservations, and handling customer inquiries\n\n### 4. Communication Skills Assessment\n- Provided brief, direct responses\n- Communicated willingness to perform key job functions\n- Responses were generally clear but minimal\n\n### 5. Concerns/Red Flags\n- Lack of prior experience in the role\n- Transportation issues could impact reliability and punctuality\n- Limited elaboration on responses may indicate potential communication challenges in a customer-facing role\n\nThe candidate shows willingness to work flexible hours including weekends, but transportation limitations and lack of experience are significant considerations for this customer-facing position.",
    "transcript": "AI: Hi, Joel. I'm the AI screening assistant for the host hostess position, and this call will take about 2, 3 minutes and will be recorded for quality and training purposes. I'll be asking you some questions about your experience and availability. Let's get started. Could you tell me about your relevant experience for this host hostess role?\nUser: I don't have any.\nAI: Thank you for letting me know. While experience can be helpful, many restaurants also provide on the job training. Let's move on to a few other questions. What your availability like for shifts? Are you available for mornings, evenings, or both?\nUser: I'm, uh, available for both the ships.\nAI: Got it. Thank you. How about weekends? Are you available to work on Saturdays and Sundays?\nUser: Yes.\nAI: Great. Thank you for confirming. Next, do you have reliable transportation to and from the restaurant?\nUser: No. Not really.\nAI: Understood. You for sharing that. Now for a host hostess role, communication and customer service are key. Are you comfortable greeting guests, managing reservations, and handling customer inquiries?\nUser: Yes. Absolutely.\nAI: Got it. Thanks for your response, Joel. That concludes our screening. Thank you for your time. Your responses will be reviewed by our hiring team. And we will be in touch soon. Have a great day.\n",
    "audioUrl": "https://storage.vapi.ai/fa783020-8e5f-4e31-9b86-b733359c7c26-1748899753466-f7a48dcb-b31a-49c0-97fa-f8059c3f9655-mono.wav",
    "completedAt": "2025-06-02T21:29:21.729Z"
  }
]